In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
from scipy import stats
from scipy.stats import shapiro
from numpy.random import randn
from numpy.random import poisson
from numpy.random import seed
from scipy.stats import ttest_1samp
from numpy.random import randn

In [4]:
df = sns.load_dataset('titanic')
df.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [30]:
df1 = df[["age","sex","fare"]]

In [15]:
df1.head(2)

    age     sex     fare
0  22.0    male   7.2500
1  38.0  female  71.2833

In [29]:
df1.describe()

              age        fare
count  714.000000  891.000000
mean    29.699118   32.204208
std     14.526497   49.693429
min      0.420000    0.000000
25%     20.125000    7.910400
50%     28.000000   14.454200
75%     38.000000   31.000000
max     80.000000  512.329200

In [11]:
df2 = df[["fare","sex"]]

In [12]:
df2.head(2)

      fare     sex
0   7.2500    male
1  71.2833  female

In [13]:
df2.describe()

             fare
count  891.000000
mean    32.204208
std     49.693429
min      0.000000
25%      7.910400
50%     14.454200
75%     31.000000
max    512.329200

In [35]:
df1.isnull().sum()

age     177
sex       0
fare      0
dtype: int64

In [40]:
df1.dropna(subset=['age'],axis=0,inplace=True)
df1.isnull().sum()

age     0
sex     0
fare    0
dtype: int64

In [42]:
# one saomle t_test
ttest_1samp(df1['age'],36)

Ttest_1sampResult(statistic=-11.590163645496572, pvalue=1.4039105468649204e-28)

In [26]:
df1_male = df1.loc[df1['sex']=='male']
df1_female = df1.loc[df1['sex']=='female']
df1_male.head()
df1_female.head()

    age     sex     fare
1  38.0  female  71.2833
2  26.0  female   7.9250
3  35.0  female  53.1000
8  27.0  female  11.1333
9  14.0  female  30.0708